Athul2004/EMBEDDED_SYSTEM/STM32-M4/Energy_Data_Acquisition/Src/main.c
/**
 ******************************************************************************
 * @file           : main.c
 * @brief          : Energy Monitor (Full UART Logging + kWh)
 ******************************************************************************
 */

#include "stm32_f446xx.h"
#include <math.h>
#include <string.h>
#include <stdlib.h>
#include <stdio.h>

// --- BUFFERS ---
#define BUF_LEN 128
uint32_t adc_buffer[BUF_LEN];
uint8_t OLED_Buffer[1024];
uint8_t cursor_x = 0;
uint8_t cursor_y = 0;

// --- CALIBRATION ---
#define V_OFFSET 2065
#define I_OFFSET 2045
float v_cal = 0.727f;
float i_cal = 0.0136f;

// --- FULL ASCII FONT ---
const uint8_t Font5x7[] = {
    0x00, 0x00, 0x00, 0x00, 0x00, // Space (32)
    0x00, 0x00, 0x5F, 0x00, 0x00, // !
    0x00, 0x07, 0x00, 0x07, 0x00, // "
    0x14, 0x7F, 0x14, 0x7F, 0x14, // #
    0x24, 0x2A, 0x7F, 0x2A, 0x12, // $
    0x23, 0x13, 0x08, 0x64, 0x62, // %
    0x36, 0x49, 0x55, 0x22, 0x50, // &
    0x00, 0x05, 0x03, 0x00, 0x00, // '
    0x00, 0x1C, 0x22, 0x41, 0x00, // (
    0x00, 0x41, 0x22, 0x1C, 0x00, // )
    0x14, 0x08, 0x3E, 0x08, 0x14, // *
    0x08, 0x08, 0x3E, 0x08, 0x08, // +
    0x00, 0x50, 0x30, 0x00, 0x00, // ,
    0x08, 0x08, 0x08, 0x08, 0x08, // -
    0x00, 0x60, 0x60, 0x00, 0x00, // .
    0x20, 0x10, 0x08, 0x04, 0x02, // /
    0x3E, 0x51, 0x49, 0x45, 0x3E, // 0
    0x00, 0x42, 0x7F, 0x40, 0x00, // 1
    0x42, 0x61, 0x51, 0x49, 0x46, // 2
    0x21, 0x41, 0x45, 0x4B, 0x31, // 3
    0x18, 0x14, 0x12, 0x7F, 0x10, // 4
    0x27, 0x45, 0x45, 0x45, 0x39, // 5
    0x3C, 0x4A, 0x49, 0x49, 0x30, // 6
    0x01, 0x71, 0x09, 0x05, 0x03, // 7
    0x36, 0x49, 0x49, 0x49, 0x36, // 8
    0x06, 0x49, 0x49, 0x29, 0x1E, // 9
    0x36, 0x36, 0x00, 0x00, 0x00, // :
    0x56, 0x36, 0x00, 0x00, 0x00, // ;
    0x08, 0x14, 0x22, 0x41, 0x00, // <
    0x14, 0x14, 0x14, 0x14, 0x14, // =
    0x00, 0x41, 0x22, 0x14, 0x08, // >
    0x02, 0x01, 0x51, 0x09, 0x06, // ?
    0x32, 0x49, 0x79, 0x41, 0x3E, // @
    0x7E, 0x11, 0x11, 0x11, 0x7E, // A
    0x7F, 0x49, 0x49, 0x49, 0x36, // B
    0x3E, 0x41, 0x41, 0x41, 0x22, // C
    0x7F, 0x41, 0x41, 0x22, 0x1C, // D
    0x7F, 0x49, 0x49, 0x49, 0x41, // E
    0x7F, 0x09, 0x09, 0x09, 0x01, // F
    0x3E, 0x41, 0x49, 0x49, 0x7A, // G
    0x7F, 0x08, 0x08, 0x08, 0x7F, // H
    0x00, 0x41, 0x7F, 0x41, 0x00, // I
    0x20, 0x40, 0x41, 0x3F, 0x01, // J
    0x7F, 0x08, 0x14, 0x22, 0x41, // K
    0x7F, 0x40, 0x40, 0x40, 0x40, // L
    0x7F, 0x02, 0x0C, 0x02, 0x7F, // M
    0x7F, 0x04, 0x08, 0x10, 0x7F, // N
    0x3E, 0x41, 0x41, 0x41, 0x3E, // O
    0x7F, 0x09, 0x09, 0x09, 0x06, // P
    0x3E, 0x41, 0x51, 0x21, 0x5E, // Q
    0x7F, 0x09, 0x19, 0x29, 0x46, // R
    0x46, 0x49, 0x49, 0x49, 0x31, // S
    0x01, 0x01, 0x7F, 0x01, 0x01, // T
    0x3F, 0x40, 0x40, 0x40, 0x3F, // U
    0x1F, 0x20, 0x40, 0x20, 0x1F, // V
    0x3F, 0x40, 0x38, 0x40, 0x3F, // W
    0x63, 0x14, 0x08, 0x14, 0x63, // X
    0x07, 0x08, 0x70, 0x08, 0x07, // Y
    0x61, 0x51, 0x49, 0x45, 0x43, // Z
    0x00, 0x7F, 0x41, 0x41, 0x00, // [
    0x02, 0x04, 0x08, 0x10, 0x20, // \
    0x00, 0x41, 0x41, 0x7F, 0x00, // ]
    0x04, 0x02, 0x01, 0x02, 0x04, // ^
    0x40, 0x40, 0x40, 0x40, 0x40, // _
    0x00, 0x01, 0x02, 0x04, 0x00, // `
    0x20, 0x54, 0x54, 0x54, 0x78, // a
    0x7F, 0x48, 0x44, 0x44, 0x38, // b
    0x38, 0x44, 0x44, 0x44, 0x20, // c
    0x38, 0x44, 0x44, 0x48, 0x7F, // d
    0x38, 0x54, 0x54, 0x54, 0x18, // e
    0x08, 0x7E, 0x09, 0x01, 0x02, // f
    0x0C, 0x52, 0x52, 0x52, 0x3E, // g
    0x7F, 0x08, 0x04, 0x04, 0x78, // h
    0x00, 0x44, 0x7D, 0x40, 0x00, // i
    0x20, 0x40, 0x44, 0x3D, 0x00, // j
    0x7F, 0x10, 0x28, 0x44, 0x00, // k
    0x00, 0x41, 0x7F, 0x40, 0x00, // l
    0x7C, 0x04, 0x18, 0x04, 0x78, // m
    0x7C, 0x08, 0x04, 0x04, 0x78, // n
    0x38, 0x44, 0x44, 0x44, 0x38, // o
    0x7C, 0x14, 0x14, 0x14, 0x08, // p
    0x08, 0x14, 0x14, 0x18, 0x7C, // q
    0x7C, 0x08, 0x04, 0x04, 0x08, // r
    0x48, 0x54, 0x54, 0x54, 0x20, // s
    0x04, 0x3F, 0x44, 0x40, 0x20, // t
    0x3C, 0x40, 0x40, 0x20, 0x7C, // u
    0x1C, 0x20, 0x40, 0x20, 0x1C, // v
    0x3C, 0x40, 0x30, 0x40, 0x3C, // w
    0x44, 0x28, 0x10, 0x28, 0x44, // x
    0x0C, 0x50, 0x50, 0x50, 0x3C, // y
    0x44, 0x64, 0x54, 0x4C, 0x44  // z
};

// --- PROTOTYPES ---
void Accumulate_Data(int start_index);
void Hardware_Init(void);
void UART2_SendString(char *string);
void UART2_SendNumber(int number);
void SSD1306_Init(void);
void SSD1306_Clear(void);
void SSD1306_Update(void);
void SSD1306_SetCursor(uint8_t x, uint8_t y);
void SSD1306_Print(char* str);
void SSD1306_PrintNumber(int num);
void SSD1306_DrawChar(char ch);
void SSD1306_PrintCentered(uint8_t y, char* str);
void I2C1_Write(uint8_t addr, uint8_t reg, uint8_t data);
void I2C1_WriteMulti(uint8_t addr, uint8_t reg, uint8_t* data, uint16_t count);

// ====================================================
//                    MAIN FUNCTION
// ====================================================
int main(void) {
    FPU_CPACR |= (0xF << 20); // Enable FPU

    Hardware_Init();
    SSD1306_Init();

    SSD1306_Clear();
    SSD1306_PrintCentered(2, "ENERGY METER");
    SSD1306_PrintCentered(4, "STARTING...");
    SSD1306_Update();

    UART2_SendString("System Online.\r\n");

    while(1) {
        if (DMA2->LISR & (1 << 4)) {
            DMA2->LIFCR |= (1 << 4);
            Accumulate_Data(0);
        }
        if (DMA2->LISR & (1 << 5)) {
            DMA2->LIFCR |= (1 << 5);
            Accumulate_Data(BUF_LEN / 2);
        }
    }
}

// ====================================================
//                  ADVANCED DSP ENGINE
// ====================================================
void Accumulate_Data(int start_index) {
    static uint64_t acc_v_sq = 0;
    static uint64_t acc_i_sq = 0;
    static float acc_p_inst = 0;
    static int sample_count = 0;

    // Frequency Calculation
    static int last_v_sign = 0;
    static int zero_crossings = 0;

    // Energy Accumulation (Watt-Seconds)
    static float energy_ws = 0.0f; // Stores Watt-Seconds

    int limit = start_index + (BUF_LEN / 2);

    for(int n = start_index; n < limit; n += 2) {
        int32_t v = (int32_t)adc_buffer[n] - V_OFFSET;
        int32_t i = (int32_t)adc_buffer[n+1] - I_OFFSET;

        acc_v_sq += (v * v);
        acc_i_sq += (i * i);
        acc_p_inst += (float)(-(v * i));

        // Hysteresis for Frequency
        if (abs(v) > 100) {
            int current_sign = (v > 0) ? 1 : -1;
            if(current_sign != last_v_sign && last_v_sign != 0) {
                zero_crossings++;
            }
            last_v_sign = current_sign;
        }
        sample_count++;
    }

    if (sample_count >= 8000) { // Approx 1.0 second update rate
        // --- 1. CALCULATIONS ---
        float v_rms = sqrtf((float)acc_v_sq / sample_count) * v_cal;
        float i_rms = sqrtf((float)acc_i_sq / sample_count) * i_cal;

        // --- NOISE GATING ---
        if (v_rms < 20.0f) {
            v_rms = 0.0f; i_rms = 0.0f; zero_crossings = 0;
        }
        if (i_rms < 0.05f) i_rms = 0.0f;

        float active_power = (acc_p_inst / sample_count) * v_cal * i_cal;
        if (i_rms == 0.0f) active_power = 0.0f;
        if (active_power < 0) active_power = -active_power;

        float apparent_power = v_rms * i_rms;

        // Power Factor
        float pf = 0.0f;
        if (apparent_power > 0.5f) {
            pf = (active_power / apparent_power) * 100.0f;
            if (pf > 100.0f) pf = 100.0f;
        }

        float frequency = (float)zero_crossings / 2.0f;

        // --- ENERGY ACCUMULATION (KWh) ---
        energy_ws += active_power;
        float energy_kwh = energy_ws / 3600000.0f; // Convert Ws -> kWh

        // --- 2. OLED DISPLAY (With kWh) ---
        SSD1306_Clear();

        // ROW 0: TITLE
        SSD1306_PrintCentered(0, "ENERGY METER");

        // ROW 2: Voltage | Current
        int i_int = (int)i_rms;
        int i_dec = (int)((i_rms - i_int) * 100);

        SSD1306_SetCursor(8, 2);
        SSD1306_Print("V:"); SSD1306_PrintNumber((int)v_rms);

        SSD1306_SetCursor(70, 2);
        SSD1306_Print("A:"); SSD1306_PrintNumber(i_int);
        SSD1306_Print("."); if(i_dec<10) SSD1306_Print("0"); SSD1306_PrintNumber(i_dec);

        // ROW 4: Active Power | Energy (kWh)
        // Format kWh like 0.000
        int e_int = (int)energy_kwh;
        int e_dec = (int)((energy_kwh - e_int) * 1000);

        SSD1306_SetCursor(8, 4);
        SSD1306_Print("W:"); SSD1306_PrintNumber((int)active_power);

        SSD1306_SetCursor(70, 4);
        SSD1306_Print("E:"); SSD1306_PrintNumber(e_int);
        SSD1306_Print(".");
        if(e_dec<100) SSD1306_Print("0");
        if(e_dec<10) SSD1306_Print("0");
        SSD1306_PrintNumber(e_dec);

        // ROW 6: Power Factor | Frequency
        SSD1306_SetCursor(8, 6);
        SSD1306_Print("PF:");
        if (pf >= 99.9f) SSD1306_Print("1.00");
        else {
            SSD1306_Print("0.");
            if(pf < 10) SSD1306_Print("0");
            SSD1306_PrintNumber((int)pf);
        }

        SSD1306_SetCursor(70, 6);
        SSD1306_Print("F:"); SSD1306_PrintNumber((int)frequency);

        SSD1306_Update();

        // --- 3. UART LOGGING (ALL PARAMETERS) ---
        UART2_SendString("\r\n--- UPDATE ---\r\n");

        // Voltage
        UART2_SendString("V: "); UART2_SendNumber((int)v_rms);

        // Current (Formatted)
        UART2_SendString(" | I: "); UART2_SendNumber(i_int); UART2_SendString("."); if(i_dec<10) UART2_SendString("0"); UART2_SendNumber(i_dec); UART2_SendString("A");

        // Power
        UART2_SendString(" | W: "); UART2_SendNumber((int)active_power);

        // Energy (Formatted)
        UART2_SendString(" | kWh: "); UART2_SendNumber(e_int); UART2_SendString(".");
        if(e_dec<100) UART2_SendString("0"); if(e_dec<10) UART2_SendString("0"); UART2_SendNumber(e_dec);

        // Power Factor
        UART2_SendString(" | PF: ");
        if (pf >= 99.9f) UART2_SendString("1.00");
        else {
            UART2_SendString("0.");
            if(pf < 10) UART2_SendString("0");
            UART2_SendNumber((int)pf);
        }

        // Frequency
        UART2_SendString(" | F: "); UART2_SendNumber((int)frequency); UART2_SendString("Hz");

        UART2_SendString("\r\n");

        acc_v_sq = 0; acc_i_sq = 0; acc_p_inst = 0; sample_count = 0;
        zero_crossings = 0;
    }
}

// ====================================================
//                  DRIVER IMPLEMENTATIONS
// ====================================================

void Hardware_Init(void) {
    ENABLE_DMA2(); ENABLE_ADC1(); ENABLE_TIM2(); ENABLE_GPIOA();
    RCC->AHB1ENR |= (1<<1); // GPIOB Enable
    RCC->APB1ENR |= (1<<21); // I2C1 Enable
    ENABLE_UART2();

    GPIOA->MODER |= (3 << 0) | (3 << 2);
    GPIOA->MODER |= (2 << 4) | (2 << 6);
    GPIOA->AFRL  |= (7 << 8) | (7 << 12);

    GPIOB->MODER |= (2 << 16) | (2 << 18);
    GPIOB->OTYPER |= (1 << 8) | (1 << 9);
    GPIOB->OSPEEDR |= (3 << 16) | (3 << 18);
    GPIOB->AFRH |= (4 << 0) | (4 << 4);

    USART2->BRR = 0x008B;
    USART2->CR1 = (1 << 13) | (1 << 3) | (1 << 2);

    I2C1->CR1 |= (1 << 15); I2C1->CR1 &= ~(1 << 15);
    I2C1->CR2 = 16; I2C1->CCR = 80; I2C1->TRISE = 17; I2C1->CR1 |= 1;

    ADC1->CR1 |= (1 << 8);
    ADC1->CR2 |= (1 << 8) | (1 << 9) | (6 << 24) | (1 << 28);
    ADC1->SQR1 = (1 << 20);
    ADC1->SQR3 = (0 << 0) | (1 << 5);
    ADC1->CR2 |= 1;

    DMA2_Stream0->CR &= ~1;
    while(DMA2_Stream0->CR & 1);
    DMA2_Stream0->PAR = (uint32_t)&ADC1->DR;
    DMA2_Stream0->M0AR = (uint32_t)adc_buffer;
    DMA2_Stream0->NDTR = BUF_LEN;
    DMA2_Stream0->CR = (0 << 25) | (2 << 13) | (2 << 11) | (1 << 10) | (1 << 8);
    DMA2_Stream0->CR |= 1;

    TIM2->PSC = 0; TIM2->ARR = 1999;
    TIM2->CR2 |= (2 << 4); TIM2->CR1 |= 1;
}

// --- UART ---
void UART2_SendString(char *string) {
    while(*string) {
        while (!(USART2->SR & (1 << 7)));
        USART2->DR = *string++;
    }
}
void UART2_SendNumber(int number) {
    char buf[12]; int i=0;
    if(number==0) { UART2_SendString("0"); return; }
    if(number<0) { UART2_SendString("-"); number=-number; }
    while(number>0) { buf[i++]=(number%10)+'0'; number/=10; }
    while(--i>=0) { while(!(USART2->SR & (1<<7))); USART2->DR=buf[i]; }
}

// --- I2C ---
void I2C1_WriteMulti(uint8_t addr, uint8_t reg, uint8_t* d, uint16_t c) {
    while(I2C1->SR2 & 2);
    I2C1->CR1 |= (1 << 8);
    while(!(I2C1->SR1 & 1));
    I2C1->DR = addr;
    while(!(I2C1->SR1 & 2));
    (void)I2C1->SR2;
    while(!(I2C1->SR1 & (1<<7)));
    I2C1->DR = reg;
    for(uint16_t i=0; i<c; i++) {
        while(!(I2C1->SR1 & (1<<7)));
        I2C1->DR = d[i];
    }
    while(!(I2C1->SR1 & (1<<7)));
    while(I2C1->SR1 & (1<<2));
    I2C1->CR1 |= (1 << 9);
}

void I2C1_Write(uint8_t addr, uint8_t reg, uint8_t data) {
    uint8_t tmp = data; I2C1_WriteMulti(addr, reg, &tmp, 1);
}

// --- OLED ---
#define SSD1306_ADDR 0x78

void SSD1306_Init(void) {
    uint8_t cmds[] = { 0xAE,0x20,0x10,0xB0,0xC8,0x00,0x10,0x40,0x81,0xFF,0xA1,0xA6,0xA8,0x3F,0xA4,0xD3,0x00,0xD5,0xF0,0xD9,0x22,0xDA,0x12,0xDB,0x20,0x8D,0x14,0xAF };
    for(int i=0; i<sizeof(cmds); i++) I2C1_Write(SSD1306_ADDR, 0x00, cmds[i]);
}

void SSD1306_Clear(void) {
    memset(OLED_Buffer, 0, 1024);
}

void SSD1306_Update(void) {
    for(int i=0; i<8; i++) {
        I2C1_Write(SSD1306_ADDR, 0x00, 0xB0+i);
        I2C1_Write(SSD1306_ADDR, 0x00, 0x00);
        I2C1_Write(SSD1306_ADDR, 0x00, 0x10);
        I2C1_WriteMulti(SSD1306_ADDR, 0x40, &OLED_Buffer[128*i], 128);
    }
}

void SSD1306_SetCursor(uint8_t x, uint8_t y) {
    cursor_x = x;
    cursor_y = y;
}

void SSD1306_DrawChar(char ch) {
    if (cursor_x >= 123) return;
    int idx = ch - 32;
    if (idx < 0 || idx > 95) idx = 0;
    for (int i=0; i<5; i++) OLED_Buffer[cursor_x++ + (cursor_y*128)] = Font5x7[(idx*5) + i];
    cursor_x++;
}

void SSD1306_Print(char* str) {
    while (*str) SSD1306_DrawChar(*str++);
}

void SSD1306_PrintNumber(int num) {
    char buf[10]; int i=0;
    if(num==0) { SSD1306_Print("0"); return; }
    while(num>0) { buf[i++]=(num%10)+'0'; num/=10; }
    while(--i>=0) SSD1306_DrawChar(buf[i]);
}

void SSD1306_PrintCentered(uint8_t y, char* str) {
    int len = 0; char* p = str;
    while(*p++) len++;
    int x = (128 - (len*6))/2;
    if(x<0) x=0;
    SSD1306_SetCursor(x, y);
    SSD1306_Print(str);
}
